massimilianocasini/esp32c6_xiao/c6_matter_thread_sd40_v1_oled/sdkconfig.defaults
# ESP32-C6 Matter/Thread SCD40 OLED Project - SDK Configuration Defaults
#
# Target: ESP32-C6 (RISC-V, Thread/802.15.4 support)
# Features: Matter, Thread, I2C (SCD40 + SSD1306 OLED)

# ==================== Target Configuration ====================
CONFIG_IDF_TARGET="esp32c6"

# ==================== Partition Table ====================
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# ==================== OpenThread Configuration ====================
CONFIG_OPENTHREAD_ENABLED=y
CONFIG_OPENTHREAD_SRP_CLIENT=y
CONFIG_OPENTHREAD_DNS_CLIENT=y
CONFIG_OPENTHREAD_LOG_LEVEL_DYNAMIC=n
CONFIG_OPENTHREAD_LOG_LEVEL_NOTE=y
CONFIG_OPENTHREAD_CLI=n

# ==================== LWIP Configuration ====================
CONFIG_LWIP_TCPIP_TASK_STACK_SIZE=4096
CONFIG_LWIP_IPV6_AUTOCONFIG=n
CONFIG_LWIP_IPV6_NUM_ADDRESSES=8
CONFIG_LWIP_MULTICAST_PING=y
CONFIG_LWIP_NETIF_STATUS_CALLBACK=y

# ==================== MDNS Platform ====================
CONFIG_USE_MINIMAL_MDNS=n
CONFIG_ENABLE_EXTENDED_DISCOVERY=y

# ==================== Matter/CHIP Configuration ====================
# Factory data provider disabled - using default provider
CONFIG_ENABLE_ESP32_FACTORY_DATA_PROVIDER=n
CONFIG_ENABLE_ESP32_DEVICE_INFO_PROVIDER=n
CONFIG_ENABLE_CHIP_SHELL=y
CONFIG_ESP_MATTER_MAX_DYNAMIC_ENDPOINT_COUNT=20
CONFIG_CHIP_PROJECT_CONFIG="main/include/CHIPProjectConfig.h"
CONFIG_CHIP_TASK_STACK_SIZE=8192

# ==================== WiFi Disabled (Thread only) ====================
CONFIG_ENABLE_WIFI_STATION=n

# ==================== Bluetooth Configuration ====================
# Required for Matter commissioning - using NimBLE
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_EXT_ADV=n
CONFIG_BT_NIMBLE_TRANSPORT_EVT_SIZE=70
CONFIG_USE_BLE_ONLY_FOR_COMMISSIONING=n

# ==================== NVS Encryption (for Matter security) ====================
CONFIG_NVS_ENCRYPTION=n
CONFIG_NVS_ASSERT_ERROR_CHECK=y

# ==================== Mbedtls Configuration ====================
CONFIG_MBEDTLS_HARDWARE_SHA=y
CONFIG_MBEDTLS_HARDWARE_AES=y
CONFIG_MBEDTLS_HARDWARE_ECC=y
CONFIG_MBEDTLS_CMAC_C=y
CONFIG_MBEDTLS_SSL_PROTO_DTLS=y
CONFIG_MBEDTLS_KEY_EXCHANGE_ECJPAKE=y
CONFIG_MBEDTLS_ECJPAKE_C=y
CONFIG_MBEDTLS_HKDF_C=y

# ==================== FreeRTOS Configuration ====================
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_MAX_TASK_NAME_LEN=32

# ==================== SPI Flash ====================
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# ==================== Serial Configuration ====================
CONFIG_ESPTOOLPY_BAUD=921600
CONFIG_ESPTOOLPY_MONITOR_BAUD=115200

# ==================== Log Configuration ====================
CONFIG_LOG_DEFAULT_LEVEL_DEBUG=n
CONFIG_LOG_DEFAULT_LEVEL=4
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y
CONFIG_LOG_MAXIMUM_LEVEL=4

# ==================== ESP System Configuration ====================
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096

# ==================== Task Watchdog ====================
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_TASK_WDT_PANIC=y

# ==================== GPIO Configuration ====================
CONFIG_GPIO_CTRL_FUNC_IN_IRAM=y

# ==================== OTA Configuration ====================
CONFIG_ENABLE_OTA_REQUESTOR=y

# ==================== Optimization ====================
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_ENABLE=y

# ==================== I2C Configuration (for SCD40 and OLED) ====================
# Using GPIO22 for SDA and GPIO23 for SCL on XIAO ESP32-C6
# I2C configuration is done in code for flexibility
CONFIG_I2C_MASTER_SDA_PIN=22
CONFIG_I2C_MASTER_SCL_PIN=23

# ==================== Button Configuration ====================
CONFIG_BUTTON_PERIOD_TIME_MS=10
CONFIG_BUTTON_DEBOUNCE_TICKS=3
CONFIG_BUTTON_LONG_PRESS_TIME_MS=3000

# ==================== Console Configuration ====================
# USB Serial JTAG (native USB on ESP32C6)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=n
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# ==================== Bootloader Log ====================
CONFIG_BOOTLOADER_LOG_LEVEL_INFO=y
CONFIG_BOOTLOADER_LOG_LEVEL=3
